//实例化
var render1=Render.init();

//search

var search=[{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},
			{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},
			{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},{name:'洋货1折',href:'#'},]
render1.search($('mainsear')[0].getElementsByTagName('ul')[0],search);
//classify
var title=['家用电器','手机、数码、京东通信','电脑、办公',
			'家居、家具、家装、厨具','男装、女装、童装、内衣','个护化妆、清洁用品、宠物',
			'鞋靴、箱包、珠宝、奢侈品','运动户外、钟表','汽车、汽车用品	',
			'母婴、玩具乐器','食品、酒类、生鲜、特产','医药保健',
			'图书、音像、电子书','彩票、旅行、充值、票务','理财、众筹、白条、保险',];

render1.classify($('classify')[0],title);
//foucsbar
var foucsbar=[{href:'#',fore:'[特惠]',cont:'8.15爆款电器，年度超低价！'},{href:'#',fore:'[特惠]',cont:'8.15爆款电器，年度超低价！'},
				{href:'#',fore:'[特惠]',cont:'8.15爆款电器，年度超低价！'},{href:'#',fore:'[特惠]',cont:'8.15爆款电器，年度超低价！'},
				{href:'#',fore:'[特惠]',cont:'8.15爆款电器，年度超低价！'},];
var foucsBarimg=[{img:'./img/57abe7ebNdc6593d1.jpg',href:'#',alt:'hello'}];
render1.focusbar($('bd')[0],foucsbar,foucsBarimg);
//主内容图片轮播
var mainpic=[{href:'#',alt:'hello',src:'./img/57b16cb0Nb6a33e58.jpg'},
			 {href:'#',alt:'hello',src:'./img/57b033f3N1951905c.jpg'},]

render1.foucsImg($('mainpic')[0],mainpic);
//分类内容
var maintain=[
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[	
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[	
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[	
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']],
				[
					[{name:'8周年庆',href:'#'},{name:'家电城',href:'#'},{name:'品牌日',href:'#'},{name:'智能生活馆',href:'#'},
					{name:'京东净化馆',href:'#'},{name:'京东帮服务店',href:'#'},{name:'家电众筹馆',href:'#'}],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视'],['电视','沸腾815','合资电视','国产电视','互联网电视'],
					['电视','沸腾815','合资电视','国产电视','互联网电视']]
					];
var img=[['./img/562f4971Na5379aba.jpg','./img/562f4971Na5379aba.jpg',
		'./img/562f4971Na5379aba.jpg','./img/562f4971Na5379aba.jpg',
		'./img/562f4971Na5379aba.jpg','./img/562f4971Na5379aba.jpg',
		'./img/562f4971Na5379aba.jpg','./img/562f4971Na5379aba.jpg'],
		['./img/57a7528bNaea050ea.jpg','./img/57a7528bNaea050ea.jpg']]
for(var i=0;i<maintain.length;i++){
render1.maintain($('allitems')[0],maintain[i],img);
}

var rolladd=[{href:'#',img:'./img/57b17084N4eef0b27.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},{href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},
			 {href:'#',img:'./img/57ad9e64Nc9f79e6b.jpg',alt:'hello'},]

render1.rolladd(document.getElementById('rolladd'),rolladd);

//事件绑定
render1.bind();